//
// Домашнее задание к занятию 19. LINQ
//
// Задача 1. Модель  компьютера  характеризуется
// кодом  и
// названием  марки компьютера,
// типом  процессора,
// частотой  работы  процессора,
// объемом оперативной памяти,
// объемом жесткого диска,
// объемом памяти видеокарты,
// стоимостью компьютера в условных единицах
// и количеством экземпляров, имеющихся в наличии.
// Создать список, содержащий 6-10 записей с различным набором значений характеристик.

internal class СomputerBase
{
}